cf_billing/DataProcessors/энргЖурналОплатыАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргЖурналОплатыАбонента</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргИсторияОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргИсторияОплаты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаАвизо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКРаспределению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Enums/энргВидыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнойДолг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МораторнаяЗадолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеструктуризированнаяЗадолженность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/DataProcessors/энргЖурналОплатыАбонента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
Функция ПолучитьДоступныеДокументыОплатыДляКорректировки(Период, Организация, Район, МКД, Абонент, ТекущийДокумент) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргИсторияОплаты.Регистратор КАК Регистратор,
	|	энргИсторияОплаты.Организация КАК Организация,
	|	энргИсторияОплаты.Район КАК Район,
	|	энргИсторияОплаты.Абонент КАК Абонент,
	|	ВЫБОР
	|		КОГДА энргИсторияОплаты.Регистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|			ТОГДА энргИсторияОплаты.СуммаКРаспределению
	|		ИНАЧЕ энргИсторияОплаты.СуммаПлатежа
	|	КОНЕЦ КАК СуммаПлатежа,
	|	энргИсторияОплаты.Разделитель КАК Разделитель
	|ПОМЕСТИТЬ ДокументыОплатыАбонента
	|ИЗ
	|	РегистрСведений.энргИсторияОплаты КАК энргИсторияОплаты
	|ГДЕ
	|	энргИсторияОплаты.Период < &Период
	|	И энргИсторияОплаты.Организация = &Организация
	|	И энргИсторияОплаты.Район = &Район
	|	И энргИсторияОплаты.Абонент = &Абонент
	|	И ВЫБОР
	|			КОГДА энргИсторияОплаты.Регистратор ССЫЛКА Документ.энргПлатежноеПоручениеВходящие
	|				ТОГДА энргИсторияОплаты.СуммаКРаспределению
	|			ИНАЧЕ энргИсторияОплаты.СуммаПлатежа
	|		КОНЕЦ > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	энргПерерасчет.Ссылка,
	|	энргПерерасчет.Организация,
	|	энргПерерасчет.Район,
	|	энргВзаиморасчеты.Абонент,
	|	энргВзаиморасчеты.Сумма,
	|	0
	|ИЗ
	|	Документ.энргПерерасчет КАК энргПерерасчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
	|		ПО энргПерерасчет.Ссылка = энргВзаиморасчеты.Регистратор
	|			И (энргПерерасчет.ВидОперации = ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.энргПерерасчет_ПереносВозвратОплаты))
	|			И (энргВзаиморасчеты.Период < &Период)
	|			И (энргВзаиморасчеты.Организация = &Организация)
	|			И (энргВзаиморасчеты.Район = &Район)
	|			И (энргВзаиморасчеты.МКД = &МКД)
	|			И (энргВзаиморасчеты.Абонент = &Абонент)
	|			И (энргВзаиморасчеты.Сумма > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыОплатыАбонента.Регистратор КАК ДокументОплаты,
	|	ДокументыОплатыАбонента.Абонент КАК Абонент,
	|	ДокументыОплатыАбонента.СуммаПлатежа КАК Сумма,
	|	ДокументыОплатыАбонента.Разделитель КАК Разделитель
	|ИЗ
	|	ДокументыОплатыАбонента КАК ДокументыОплатыАбонента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.энргПерерасчет.КорректировкаОплаты КАК энргПерерасчетКорректировкаОплаты
	|		ПО ДокументыОплатыАбонента.Регистратор = энргПерерасчетКорректировкаОплаты.ДокументОплаты
	|			И ДокументыОплатыАбонента.Разделитель = энргПерерасчетКорректировкаОплаты.Разделитель
	|			И (НЕ энргПерерасчетКорректировкаОплаты.Ссылка.ПометкаУдаления)
	|			И (НЕ энргПерерасчетКорректировкаОплаты.Ссылка = &ТекущийДокумент)
	|			И (энргПерерасчетКорректировкаОплаты.Ссылка.Абонент = &Абонент)
	|ГДЕ
	|	энргПерерасчетКорректировкаОплаты.ДокументОплаты ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыОплатыАбонента.Регистратор.Дата,
	|	ДокументыОплатыАбонента.Разделитель";
	
	Запрос.УстановитьПараметр("Период"			, Период);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("Район"			, Район);
	Запрос.УстановитьПараметр("МКД"				, МКД);
	Запрос.УстановитьПараметр("Абонент"			, Абонент);
	Запрос.УстановитьПараметр("ТекущийДокумент"	, ТекущийДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьРаспределениеДокументовОплаты(ТЗДокументыОплат, Абонент) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗДокументыОплат.ДокументОплаты КАК ДокументОплаты,
		|	ТЗДокументыОплат.Разделитель КАК Разделитель,
		|	&Абонент КАК Абонент
		|ПОМЕСТИТЬ ДокументыОплаты
		|ИЗ
		|	&ТЗДокументыОплат КАК ТЗДокументыОплат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
		|	ДокументыОплаты.Абонент КАК Абонент,
		|	энргВзаиморасчетыПоМесяцам.Услуга КАК Услуга,
		|	энргВзаиморасчетыПоМесяцам.ПериодНачисления КАК ПериодНачисления,
		|	энргВзаиморасчетыПоМесяцам.Поставщик КАК Поставщик,
		|	энргВзаиморасчетыПоМесяцам.Сумма КАК СуммаОплаты,
		|	ЗНАЧЕНИЕ(Перечисление.энргВидыЗадолженности.ОсновнойДолг) КАК ВидЗадолженности
		|ИЗ
		|	ДокументыОплаты КАК ДокументыОплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.энргВзаиморасчетыПоМесяцам КАК энргВзаиморасчетыПоМесяцам
		|		ПО ДокументыОплаты.ДокументОплаты = энргВзаиморасчетыПоМесяцам.Регистратор
		|			И ДокументыОплаты.Разделитель = энргВзаиморасчетыПоМесяцам.Разделитель
		|			И ДокументыОплаты.Абонент = энргВзаиморасчетыПоМесяцам.Абонент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОплаты";
	
	Запрос.УстановитьПараметр("ТЗДокументыОплат", ТЗДокументыОплат);
	Запрос.УстановитьПараметр("Абонент"			, Абонент);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти

#КонецЕсли
